[
    {
        "message": "Российские офисы Intel расположены в Москве и в Нижнем Новгороде. В них создаются продукты для решения задач в области анализа и обработки данных, искусственного интеллекта, компьютерного зрения и других актуальных направлений. Работая в Intel, вы станете частью международной команды инженеров, которые разрабатывают технологии, меняющие мир. \nПрисоединяйтесь к команде лучших IT-экспертов: http://career.intel.com/tp/rj6.4Ipod-e.K",
        "date": "2021-05-12T09:03:06+00:00",
        "message_id": 2534,
        "channel": "Терабит: it технологии",
        "current": false
    },
    {
        "message": "Министерство обороны США признало, что Xiaomi не имеет никаких связей с китайским правительством и не принадлежит китайским военным.\n\nПравительство признало свою ошибку и заявило о готовности урегулировать вопрос и исключить компанию из черного списка.",
        "date": "2021-05-12T08:51:42+00:00",
        "message_id": 2533,
        "channel": "Терабит: it технологии",
        "current": false
    },
    {
        "message": "Очередные тревожные новости для Apple. К разработчикам приложений, объединившимся против монополистской политики App Store, присоединились пользователи. Британцы подали коллективный иск против компании, утверждая, что вынуждены переплачивать за покупки во встроенном магазине приложений. \n\nВсе дело в установленной Apple комиссии в размере 15-30% с каждой покупки, из-за чего разработчики завышают цены. При этом альтернатив у пользователей нет, так как установка приложений возможна только из App Store и на единых условиях.\n\nБеспрецедентна и сумма иска - она может достичь $2,1 млрд из-за того, что речь идет о компенсациях для всех британских владельцев мобильных устройств Apple, покупавших что-то в App Store после 1 октября 2015 года. Таких насчитывается порядка 20 млн человек.",
        "date": "2021-05-11T15:02:32+00:00",
        "message_id": 2532,
        "channel": "Терабит: it технологии",
        "current": false
    }
]