[
    {
        "message": "[​​](https://telegra.ph/file/7f29bd95af6061207e0a6.jpg)**ФСБ хочет создать систему ключей, открывающих силовикам зашифрованные данные в приложениях**🤔\n\nРоссийская ФСБ предложила создать универсальную систему ключей шифрования от мобильных приложений — **для оперативного доступа правоохранителей к зашифрованной информации.** [Об этом сообщил замглавы МИД РФ Олег Сыромолотов](https://www.fontanka.ru/2021/05/12/69910055/).\n\n__«Хотел бы обратить внимание на контртеррористическую инициативу ФСБ России по созданию универсальной системы доверенного хранения ключей шифрования от мобильных приложений... Не буду углубляться в детали. Скажу только, что это предложение в целом воспринято позитивно зарубежными партнерами»__, — заявил Сыромолотов.\n\nПо его мнению, с социальными сетями связаны риски распространения информации, «восхваляющей насилие и терроризм».🤷🏼‍♀️ Кроме того Сыромолотов указал на опасность радикализации населения в соцсетях. Замглавы МИД считает, что соцсети могут использовать для воздействия на отдельные социальные группы — в том числе на молодежь🤦🏼‍♀️\n=================\nЧтож, даже если подобная инициатива и вступит в силу, мало вероятно, что она заденет свободные приложения, где пользователи могут самостоятельно генерировать или даже импортировать ключи шифрования.\n\nИменно такими программами и пользуются настоящие  ультра-радикалы🤔\n\nА следовательно **инициатива ФСБ направлена вовсе не против них, а против обычных потребителей**.",
        "date": "2021-05-12T09:57:24+00:00",
        "message_id": 1417,
        "channel": "Черный Треугольник 🥀⃤",
        "current": false
    },
    {
        "message": "[​​](https://telegra.ph/file/b2d5114e824c2c17994e2.jpg)**IBM собирает набор данных, чтобы научить программное обеспечение, как создается программное обеспечение**🤔\n\nЭтот набор, получивший название [Project CodeNet](https://research.ibm.com/blog/codenet-ai-for-code), содержит, 14 миллионов примеров кода на общую сумму 500 миллионов строк на более чем 55 языках программирования, от Java, C и Go до COBOL, Pascal и FORTRAN. По правде говоря, более трех четвертей всего написано на C ++ и Python.\n\nЭтот исходный код не был взят из производства, ни в процессе развития приложений: она была собрана из записей , представленных в двух конкурсов по программированию, организованных в Японии: Айдз и AtCoder. В этих соревнованиях конкурентам предлагается написать необходимый код, чтобы превратить заданный набор входных данных в набор желаемых выходных данных.\n\nСуть в том, что в идеале искусственный интеллект, обученный на этом наборе сможет определять хорошие программы и отклонять плохие, преобразовывать устаревшие кодовые базы на современные языки, выполнять поиск приложений и источников библиотеки для желаемых подпрограмм, или, возможно, переводить с одного языка на другой🤨\n\nКоманда, разработавшая набор данных, разместила все собранные материалы [на странице проекта на GitHub](https://github.com/IBM/Project_CodeNet)\n===============\n__Чтож, не далек тот день, когда программисты станут не нужны__🤷🏼‍♀️",
        "date": "2021-05-12T08:51:36+00:00",
        "message_id": 1416,
        "channel": "Черный Треугольник 🥀⃤",
        "current": false
    },
    {
        "message": "[​​](https://telegra.ph/file/d18ca018ad4e4197d1353.jpg)**FragAttacks — обнаружены новые дыры в WiFi**😳\n\n11 мая  Wi-Fi Alliance сообщил, что исследователи безопасности выявили новые уязвимости в устройствах Wi-Fi. Уязвимость называется FragAttacks и представляет собой так называемую уязвимость Man-In-The-Middle (MITM), которая связана со способом передачи интернет-трафика между точками доступа Wi-Fi и пользовательскими устройствами.\n\nОбнаруженные уязвимости **затрагивают все современные протоколы безопасности Wi-Fi, включая последнюю спецификацию WPA3**.😓 Затронут даже исходный протокол безопасности Wi-Fi, называемый WEP. \n\n**Это озночает что дыры были частью Wi-Fi с момента его выпуска в 1997 году!**😱\n\nЭтот набор уязвимостей требует, чтобы потенциальный злоумышленник физически находился в пределах досягаемости сети Wi-Fi (или пользовательского устройства), чтобы воспользоваться им. \n\nАтакующий способен **перехватить конфиденциальную информацию, удаленно управлять устройствами интернета вещей подключенными к вашей сети, также уязвимости могут использоваться в качестве трамплина для запуска сложных атак.\n\n**Подробно об `FragAttacks` с видео демонстрациями можно ознакомиться на сайте https://www.fragattacks.com/",
        "date": "2021-05-11T21:44:24+00:00",
        "message_id": 1415,
        "channel": "Черный Треугольник 🥀⃤",
        "current": false
    },
    {
        "message": "[​​](https://telegra.ph/file/7f1b8452e4fc16c978b6d.jpg)**По мнению Госдумы в нападении на школу в Казани виновата анонимность в интеренте**🤦🏼‍♀️\n\n[После стрельбы в казанской школе спикер Госдумы Вячеслав Володин заявил, что в Думе готовы](https://www.interfax.ru/russia/765481) **обсудить идею запрета на анонимность в интернете**. Депутаты считают ее виновной в пропаганде насилия и экстремизма🤦🏼‍♀️\n\n__\"Звучат предложения уйти от анонимности в интернете, что позволит, считают сторонники этой идеи, в разы снизить объем контента, пропагандирующего насилие, героизирующего экстремизм. Необходимо обсуждать\"__, - написал Володин в своем телеграм-канале\n\nСегодня в Казани отчисленный в апреле из колледжа 19-летний Ильназ Галявиев устроил стрельбу в школе №175, где он раньше учился. В результате погибли девять человек, в том числе семь детей и две учительницы. Галявиев был задержан, возбуждено уголовное дело.\n================\nУдивлен что не приплели любимую байку \"во всем виноваты компьютерные игры\"🤷🏼‍♀️\n\n__Чтож впереди  новые запреты и ограничения...__",
        "date": "2021-05-11T17:57:06+00:00",
        "message_id": 1414,
        "channel": "Черный Треугольник 🥀⃤",
        "current": false
    }
]